IDEA StatiCa Open Model
Hanging.DiameterOfMandrel Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double DiameterOfMandrel { get; set; }
Public Property DiameterOfMandrel As Double
	Get
	Set
public:
property double DiameterOfMandrel {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
Hanging Class
IdeaRS.OpenModel.Detail Namespace